node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 2601577
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\214\241\203=3\022K=\341\304\363\275\373Q\252\275)\036\350\275l,(\275Q\276\350\274\244\022\346<z\010\005\276\342\336\313\275\244s\370\273\022\002\204=\017\365\314\276\354\2138\2762\376\341\275i\310o=\200\000\226\276\263>\305=\374\373_=i\027\265=\\\220\314=\000\355D\276\014\333\240=\347\212 \276\226\324\225=\267\355\016\274\336wZ>\003\214\220\275\224\352y>\221\3013\274:\0135<\257:\003>~8\251<\354\005\024\276\251\"\270\275s[\007>\365Ar>%\031\033\275\246>8\276sn\204\274\374*\313=\304\023\234\274\235X\341\274\277\326*>\241\337;=\340w=\276\361\0058=\255\215s=\r\236\307=\236X\206\274G\243\204\275d\242=>\204\371\006=\022G\313=\334|\024\276\003\304=\274\350\301t\275DB~\275\360%\230>\313\023\260=\265:\242=\377)\002\273LVO>\177p\324;\377_j\276GX\271=3\'/\272\263\036\340\274\204\350\215\276\331\260\205=\303\373#=\331\000:\275\262R\270\275\031\206\223=\276\316%>\003\271V\276\213\2518=\275\370\260=\227\273\303\276\004\302n\276\367iS=x\213C=Vsn\273l\356\247\275:c\255=\232\254\357=\221 E>\350\301\323\275R\205\016\276\006]\026>\000+C\275\016m\010=\031\032\221=\331P\035\276\366\356\241;\346\240U\274\276\001\274\274\231\254\220=\002E\254\275bE\234\274\251m5>\213M\336;0\246-=\353\0314\276=\274c\276\230n\223>M\311\304\275w\334\000\2753\035@=\261\256/>4_\262\275anF\2757\271\327\275\001\3458=\002\'\374\275D@\021=\371\0001>\255J?\275\363g\252=\017\3760><+\265=\275\325\270;\267s3\275\027\313^>I\342D\276\003\234\355=\337@I<\236z\233\274O\251\201\275\305\271\304\275\344\352\212\276-\203\000>\241w\341=;\"\277\273A\250\222=\001\352\251\274,O\261==\3209\275\252GP<-U\350\274\023m=>\242n\310\275\'\366,\273\275\336\323=\261\216\316;1\333\025\275\370T\036=\371\301I=-\333\311\275\243\272\202\276\3060u>x\327\023\276,7\324\275\211\000\314<D\324\005\276`!\371=\024\327\033>KZ\226\275\372X!\273\321\020\027\276\2774F\276\363z\251\273\345\0330<\356\355\221\275\247\023\357\275\005\356\300\274\0024\233\275\271\361\216\275\031\212\304\275\227\362\255\2766\303>=\r\347K\276\3768\231\275j\333\016\276\261\202\200\276\021\017\r=\r\'F\276P\017\014\276\244bA=Cn\212>\030\260\327<AG\237\276aKF>\r\317\237=\201\364\375<\r\"\312=A.\023\275\376]*=\r\000\242=\214\275\204=\302\225\027>\351\200\037>\200\334[;4R\026>#\325C\2766\325\207=\252\036\'\276!\362\363\274\361\312\217\275*\261J\2767\241!\273a^\203\276)7\244=\205\225\030=\327\237\302=H\276\341\274\221\357\326<\0372\372\275\241 \222\275:!\314;:\244\005>x\017\310\275G;\330\274\370\340\202=H\326W\276\235\022\241>\314C\026=\374\030!>Rn\022>_\022\306=\036`1\274D\206\032>\226[\254>\311*\361=4c#>\256\200W=\177g\333=\230\241w=\271\022\177=\252\206W>\367\254\206\275\021\215\255\275\375\355z=\306\366\n\276R\355\014>\3124!=\220<\004\276m\000k\275\371\313q\275\306\270\227<[\n\212>M\347\002>\226B\003<\314<\241\2754\363\203\275\267\221P>7\367m\276\3342l=Y\265=\276\256#\207\275\273\210\006\275\266`V\275\215\316\271=\361^n\275\301C\"\276@\032o> \235\241\275\335\2007=\345\203\022>\246\314,\276\372\004\005<\234\227\370=\311\264\210\274+g\360<\377\033I<\257b\271=\262\306\020\276_\n\217\276\326\007\010>\035$F\276\370y\332\275U\3000=\266h\201<1\330N>\217\004\244=\215<;=\340K\237=1\']>\\Y\277<I\301U\275\261\364\263\274\3341\267\275\206\030\034\276\305\367n<\312VX\276\210\370\271<-\372\200=\374\343\373=\242<j\276\375\264T>%uB>\330\rO\276p\347W=1\215\235=6\261\010>\271\233\266\275\304\255\027<0#\212=\201\333E=\216\004\213=\023V\210\276=\"\354;{V\323\275A\376\217=\277\377\005>\225\262C>\321\216\212\275\376\023\320=\212\256V<V\245\341\275\342\327\026\275\237\373]\274\367p\302\274_\304(=g\3621=\005\006y\276=\\:\276\376\271\022\276.2\023>\353h>\276\301\341.\275\030\211\250\276\252%3\275V\315J>\340-\256\276z\254\365\275\254h\020=\026\2156\276\272\332\256\274ykF\274\t\347%\275^\342E=\235\223\246=\005y\305\274&y\365=\347h\016\275\230\230\376\275\226\272\003\276!(\250\276\202Z\207:\300l`\274\327\306+\275\033D\010\276\321\212\261=\331\235\324=\305\257\021>\355\177\013\276u\004%\276JY\345\275\312\3550>\331\205?=}\325\274\2756\375J\275\2621^\275\373\007!=\341\373\241=1\300\235\273\026\005\345\273\227\\\225=@\334X=`\351\211=\003\312G\275\301\304\033\276S\246\014=\253\376\031\276\017\245 >\311C\265<7%>\276WX\242>2\263I\275\177\373\t\276\2657%\276\223\237\\\276\264!\273\274|\350\346=\202\225\013\276E\337K=\327@\220<1hv\275\030\225\333\275/e\006>\307F\276\275v\345(\272\006\344E<q\314\326\275\005j/>\322\257=\276eR\351=\321B\254=\220\003W\275\356\213\341=\311\341V\275j^\350=x\302\035>\027\342\026>,\276\252\274k X\276\2414i>8R\246=\360\210\351<\336\016\266\275\200\351C=\321\342\347<J\272y<\032y\\=\275\231\310\275\356\2076>Zy{>\204U\357=;\271\030>\355*\365=\354i\322=-\362\362\274YD\375=\264\034N\276]1\237>*\245\261=\026\277\230\272\265\226\347<\236\323\202=,^B\275\323\014,>~\3250>\265\315O=kN9=Z\362J=\353\202\230=\024g\233=w\r.>\375\272M\276\215\344\203=\230\021i=o\267u=\331\227\223\274\020\277\206\276\305A&=o\232.<\261\323\376=G#,=[l\303\274\355\013\000\275|\204=<\022d2\275\031W\017>8\"m\274q/{=\223\262W<\\w\316=\014\2333=~\240S>a\346!>\365\202\253\274$\2267\276\227\344\265\275;@\210\275\223\201\017\276<n\307=\322\026\317\275\274t\300\274\037\347\025>\207FJ>\250\3274=\034\227\340\274hQ\230>P?s\276\210\035\016>\\y\211>\244k\'<T\221F=\251\004\362\275\357\336\243=\021\020\206\276G\374\207\276\317Q*>)\313(\275\317\322l>i\207\351=\264R\363\273\201\375\021=\t\3478\2758\364&\276\241\327\204=\033\\l\275\335\177\376\275\212\2463>\226\252\314\275\262\032\264\274\371\274\224\276}\252\335<\306\3660>\262\001D\275\252\001b<V\006\203\275\031\243\230<\345Q\014=\216\244\333<\376\371\n=\364Y\363=\201,\210\274\234Y\'\276J\3630\276\313ae\275s\212\021>\030\317X>W\205.>\365\272\004=/\257\031>\t+\201>\347\217q>\263\300\200\276\264;R>\315\274\211\275\345\252b=\361\231\267=;\247\241=(W\005>\221L\315=\033\215X\276\240\227\335\274y\257>\276\261\004\026=\332h\277:\016\n\214=D\233\r\2759\234+\276\001\246\002>-\346\244=\024\237t=\335\323\204\276|0\t>\027\272\004\276\006\216Z=$\3544\275\257d\000\2766\227\201=4\310\360\271*\3368>H\273\346=\247\000~=\325]\035\275\r}f=x\377F\275\364\001\265\276\212\254\023>\0260\324<=\207\017\276\025\3007=T0\277=\020\226B>\360\206\226\275\\&J>\310~\010\2762\357Y\275\331\250\212=\265\263\317\275\357QV>\277tW\276C3s=\233\214\315\275\027,,=&@\207\275\034U\203=\227\266\221;\001\251\017>p\021\244<\373\003\323=\226\246\021>E \003\276\240,\365\275\372\257\017\276FC\023>\324\312\234\276E\361\222=G\030\177\276\241\267C\275\375\013\331\275\3210\304\2751\000A=\2570X\274r\231\037\275w\013\215\275\251/\206\273\277$\201\2751|\037\276SE\204<-E\275\275\204\322\307\275\325\355M\274\262\343\206=\367G\223<\r\341\250\275\226vq\276\316\211\261=MI\321=\205\235G=\3344\324\275\022\275\253>\'\334\237\275\372\202\024<\260\347\336=n\240\360\275\213\364J\275\317\215O\275\315\\\007\276\240\034\353\274\272\033\306=(\373\224=r\204\313\275\224w\031\276.\205->\363\027\257>P\223#>\211\rG\276\262\263\037\275\325\254V<i3H>\316\207\236=\261^\260=\001\017\326\275\321\245 =\214\207W>\275\356\t\276k\014\235\2757S\354=Xq\225\276\343\370\036>\206\364{\276\353\031\177\274\014\214\007>+?d\276\307\223G\276\313\216\177\275\365B\247\275K3\014\276n\021\305\275\020r5\275\362?\321=v\262+\275\237Uv=^\310\323\275]\340\241\275\255\002\314=\250$\265<\317\355F\275+\223\n=;\014\212>\257\227\331\275\357C\024=\336\347\016>q-/\276Wc\'>\257[\263\274A\270\244\275\261\351\037<6\236\363;W\303\'=w\013 <\355\343\263=21*\275\3303\t\276\241K:\276\240-\265\274\307\020H\275s\270\233=\216\317\365\274]?1>h\276\256\275\327T(\275\312\016\224=\021\224U\275\370\230X\276H\315\361<1n\\\276\023\323%\2765\366\331=\025\345\254\274?S\"\275Wr\226\276\2603\235\275\230\306\274=\301p\353=\2674\352=\356\206\201\275\274-\270\275b\225\247=\256y\246<\330\316\263<O\335\032\276_\313G>gz\222=\233\263\020\276\035\2453\276\301D\346\275u\376><\222f\253\276[\r\016>\242\241l\276>\317\t\2765\326S>\035\237\307\275\344\361\201=\376=\265\274\336)\325\275\001\236)\2758\370\231\275\210\275~=\306n\211>e@X\276\364)\177\275\221\275P\274\345\036P\275\"\356\231<g!\235\275\307\267\030=H\225\201>\345iv\275\235\224\000>\033A\253\273\242I\237\275\256\255\276<\225\363R>\003\352\347=O\375\230<\241\376B>\250\3312\276\320`\024\276_Ua\273\255K\033>[\275I=6\352r>H\023\027\275\276\262\375=\034+\273\276\254\245S>#\214\243=\371\232\312<3(\317=\303[\352\275\207^:>+\2623:\205\343\251\275\214\356\252=[\002\352\275\201\022\r>\222_\311\275K-\r\276\347Y\023=x_\214\274\263\215&\276B(\322\275\200\340\203\275\372\2467\275\006\'E>\024D\205=\206\035/\276\277\361\000>\3104\360\274r\330\360\2751G\034\276\276\325\227>\346\267\315=o\034\214=\255t\314\275\3561Z=/A\t\276\007\236\001=\271\n\274=`\'W>^\240\273\274\346\202{\2743tW=\252\026\003=\230\020z\274\260\374\374\275\202W\261\275\363 \272\275V\324\230=c\034\017>\002n\341\275\322\365\367\275\t\221u\275\0055\255\276\265\356;\275\360a\007<\277n\204\2766/\000\276\236\344X=\t#\244=\274\202z=?kQ>Ak\000=\305x:\276\021^4=\227\232\245<\337\016\246\275>k\265\275\203\330\007=\346cn\276pe\325\274\233\351\234\275\271\371-\274.\321\340\274\375\356\214\275\365\031\374\275\266\335\221\275L\033\"\276\372\277\177=\315G\204\276\001-\225=k\275@\275\362\227\202>\307\342\226>\377\254\201=\273~\255=q\372\231<\234\037\030\276:\022\032>\366\037\307\275\022\313\246<?\224\213\276\024\254L<z\337\216:q\276\272=k\372|=!\225\343\275\024\023\363\273\326>\257<%6\376=J\024\254\275\266\356P\276<o\323<\252p\022\275r\215\257\274G1\203>\321\022\363=D\345V=\007\347\310=\2052O=e\371\217\275\217\201\005\276\255\302\201=]\025\t\275\250\202\327<M\204)>\352EF\275\216t\257=0\271\233\275\220ft\276\224\260Z\275\357\200\201=\230\267/\2753J\037\276\364h/=}\013\021=fni\276\373>\010>>\253c>0\014\375=\307^*>\323\367\265=\266\371\345=\256bu\276\314q\235>\316\251\022=\017\352<\276N3\252=\310KL>C\232\304<=\313\030\275\300\031\253=V\306z;\002\r\247=\331l\373=\222\352\212\276\212\263y=\313\240#>\020Q\221\276\360\177\213<n\222\024\275\237\006\323\274\344\002\363=\301J\325\275\0101j\274LF\336\275\343U\022\276NU\205<v\334\001>*/\243\275V_-\275\017\365\262\275`\034r<\256\363\033=q\310\006>{\364&>U1\004=u\265\314\275xR#\276\311\242B\275wz@\276\t\333\002\276\300\313\256=\177%\357\274\342\271\000>\302\263u=\001h\023\275\263\'_\275\246\232\371\273\271\234 \276\247\327\016<\342\036/\276\035r >\231\277\261\276\253\366S=\260\277;\276\032\374Q>Ga\341=\005\375\316\275r\200\014\276_}\211=s\256`=\327RL\276W\032f=\231\016\007>f\221\017\276\345\"&=\260x\277=\352\322N\275\377\356\177\2750\301(<\337%\224\275\177\227\001>\2566$\275\355\246\025\276\260\030!\275i0\363\275\256\345\345=6\272Q\275\2208\005\276\344\r\226\276\r\207\006=\316\331\243=\374\375\330\275\r\000\246=\030t\t=\221\232\235\275i&\342=\0330\364\275\214r\267=\257\360E>\370nk\275\306\361\206>\207\213\223=P8\242={\237\210\276[\216\003>U\226`>\026\346\001\275\334 \023>\232w\332\275bm\315=\035r+\273\036N\242\276\216\211\251\275Jq\275\274?\233\225\275\361\027\314\275%\025\240\276/\252z>\223\247\021\275%\336\370=Q\350\334=J\236?\274!n\016>\007\346A\275\321\000;>\225\243\266=\310z\347\275\367S\202=n\353I>\333\304I=`\224\016\276\212\007\022>x8A\276 l\307=\257!\'\2736\350z=\010\003\350=f%\035>\022r\302=\035\262\216=\312\347\273;e\217V\276\3552\347=\262\002\315\273\212Y\331=\212\260\020>\226\267U\275|L.>g\307\207;\020\303\232\275\334\362\234<\357g\331\273[\251\027\275F8\274=\000\"\017\275E[\226>\306G\024>4<^\276E}\240\273@\005\315\275\373\t\365<\010\005?>\357\'\244\274\014@\362=\025\024C\276h\314\r>xw\005\276K\200\025\275C\274\235=\236\366\275<\227`\205=\230\\\241=\325\352\314<U\213+=\350s\345=\355\2067\275\223\377\020:\245b\031\273\014C\322<\375t^>\332\251\002\276\324\316\352\275\347\352\366\274\224\366t=s0\025<\2526\001>\2610\271\276<\021Q>\273[r\276\226\214\232\275\373\351\270=\355\220b\274\273\351,\276~{\023\276\246\210\260\275;m\305\275`\021\210\2767\026\014<\347O-=\207\246c=\207\371\\>[7\262\2743+\200=6\014\263=\006\302\202=\"\315\267=\220\301.\276\341\225\352\275\335\314\003\275\323\347\021>}2r>\354\n\210\275h\214y=\371\202\215\276\253V\205<\341(b\275j\230\007<H\000\032\276 \346\223\275O\212E\276.X,=\357?\376\2754\036\220\275\373:\322<\321F`=\320=-<VfV\276\3737\005>\245 V>F\366\005\276\"\334K>F\231d>\351Nk\276`\334)>\205>\337\275\010P\206\276\272@)=\337\252\204\275\276~\n\276\362m\005>\211Q\246<q\022\013\275\344\035\302=*-\270=\327\031\013\276\204!~\274\036\034\336\275\235Q\033\276\023\364\257<\3263\024\276Hr\253=\252]y\275\362\263\310\275/ \236=\354\362D<\370v\336=\364Hg\275\277\210,=\256<\232\275\327\3431\275\261\030\031=\230\345T>\206\000\242\276\024\361\005\273\n(z=\266c\352\275v\032\257\275t\357\256\274\205\301\001<\322u\221\275\251U\256\275\3748\034\2766\026\241:^7\233<r\000+>\227h\200>\210\326\261>\370y}\275a\203*><\347\261=\343R\260\275\316\222@>\353\362\251\275\252\010\016\276\n\362\336=\374}\214\275\005\240\014\275\264\336\356\275\226\036o=K\200\212=?e\214>\240\277k\275\261\314\242=|2\214>\347\2334>5\334^>\352\342==\027\001~\274\346\313\001\275\305\t\372==\035\262=\340=\316=#\226\023\276#\267\025>U\362#\276\3609R\276`\351\325\274l\363I\276\236\004\021=|\322,\274\336%\027\276r/\372=\340\202\303=\354\352\216=\242!\220=dn\">gn\372\271\236\2330>o\245\261<\325\230(>\345*><O\313\342\273\361\350-\276C\347\017\273f\351z\275\246\321\217=\203\206\241=Eb\035\275m\212\t\273\375\2422\276\003\273\003\276\376I\341\275X\324\215\275*H\306\275\tX\006>\3268\033\275f\362*\276r\227\351\275\226\227\227\275:\t(\275E\317@>\224\341[=\271\304\025>\336\332k>>5\021\275&\263\313=\233\326\257=\033)s>\355zk>\234\274\324\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
